brew2u/app/controllers/establishments_controller.rb

SELECT "establishments".* FROM "establishments"
---
    def index
        establishments = Establishment.all

INSERT INTO "establishments" ("admin_id", "company_name", "coffee_or_beer", "phone", "website", "street_1", "street_2", "city", "state", "zip", "hours_of_operation", "pet_friendly", "wifi", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15) RETURNING "id"
---
    def create
        establishment = current_admin.establishments.new(establishment_params)
        if establishment.save